{
    "and": "Operador lógico 'Y'. Devuelve True si ambas condiciones son verdaderas.",
    "as": "Se usa para crear un alias al importar módulos (ej: `import math as m`) o en excepciones.",
    "assert": "Verifica si una condición es verdadera; si no, lanza un error. Útil para depurar.",
    "async": "Define una función como asíncrona (corutina).",
    "await": "Pausa la ejecución de una función asíncrona hasta que una tarea termine.",
    "break": "Rompe y sale inmediatamente de un bucle (`for` o `while`).",
    "class": "Define una nueva clase (plantilla para crear objetos).",
    "continue": "Salta a la siguiente iteración de un bucle, ignorando el resto del código en esa vuelta.",
    "def": "Define una nueva función.",
    "del": "Elimina un objeto, variable o elemento de una lista/diccionario.",
    "elif": "'Else If'. Permite comprobar múltiples condiciones en cadena.",
    "else": "'Si no'. Ejecuta un bloque de código si la condición `if` anterior es falsa.",
    "except": "Captura y maneja excepciones (errores) dentro de un bloque `try`.",
    "finally": "Bloque que se ejecuta siempre al final de un `try`, haya error o no.",
    "for": "Crea un bucle que itera sobre una secuencia (lista, texto, rango).",
    "from": "Indica de qué módulo o paquete importar algo específico.",
    "global": "Declara que una variable dentro de una función se refiere a una variable global.",
    "if": "Estructura de control condicional. Ejecuta código si la condición es verdadera.",
    "import": "Importa un módulo o librería externa.",
    "in": "Verifica si un elemento está dentro de una secuencia (lista, texto). También se usa en `for`.",
    "is": "Compara si dos variables apuntan al *mismo* objeto en memoria (identidad).",
    "lambda": "Crea una función anónima pequeña en una sola línea.",
    "not": "Operador lógico de negación. Invierte el valor de verdad (`True` -> `False`).",
    "or": "Operador lógico 'O'. Devuelve True si al menos una condición es verdadera.",
    "pass": "No hace nada. Se usa como marcador de posición cuando la sintaxis requiere código.",
    "raise": "Lanza manualmente una excepción (error).",
    "return": "Devuelve un valor desde una función y termina su ejecución.",
    "try": "Inicia un bloque de código propenso a errores para manejarlos con `except`.",
    "while": "Crea un bucle que se repite mientras una condición sea verdadera.",
    "with": "Simplifica el manejo de recursos (como abrir archivos), asegurando que se cierren correctamente.",
    "yield": "Pausa una función y devuelve un valor, permitiendo reanudarla después (generadores).",
    "abs": "Devuelve el valor absoluto de un número (positivo).",
    "bin": "Convierte un número entero a su representación binaria (texto).",
    "bool": "Convierte un valor a booleano (`True` o `False`).",
    "dict": "Crea un nuevo diccionario.",
    "enumerate": "Añade un contador a un iterable y lo devuelve como objeto enumerado.",
    "exit": "Termina la ejecución del programa.",
    "filter": "Filtra elementos de un iterable basándose en una función.",
    "float": "Convierte un valor a número decimal (flotante).",
    "format": "Formatea un valor (ej: número de decimales).",
    "input": "Lee una línea de texto desde la entrada del usuario (teclado).",
    "int": "Convierte un valor a número entero.",
    "len": "Devuelve la longitud (número de elementos) de un objeto (lista, texto, etc.).",
    "list": "Crea una nueva lista.",
    "map": "Aplica una función a cada elemento de un iterable.",
    "open": "Abre un archivo y devuelve el objeto archivo correspondiente.",
    "print": "Muestra texto o variables en la consola.",
    "range": "Genera una secuencia de números.",
    "reversed": "Devuelve un iterador inverso de una secuencia.",
    "round": "Redondea un número a una cantidad de decimales dada.",
    "set": "Crea un nuevo conjunto (colección sin duplicados).",
    "sorted": "Devuelve una nueva lista ordenada a partir de un iterable.",
    "str": "Convierte un valor a cadena de texto.",
    "sum": "Suma los elementos de un iterable.",
    "tuple": "Crea una nueva tupla (lista inmutable).",
    "type": "Devuelve el tipo de un objeto.",
    "zip": "Combina elementos de varios iterables en tuplas.",
    "append": "Añade un elemento al final de una lista.",
    "capitalize": "Convierte la primera letra de un texto a mayúscula.",
    "clear": "Elimina todos los elementos de una lista o diccionario.",
    "count": "Cuenta cuántas veces aparece un elemento.",
    "decode": "Decodifica bytes a texto (string).",
    "encode": "Codifica texto a bytes.",
    "extend": "Añade los elementos de un iterable al final de una lista.",
    "find": "Busca una subcadena y devuelve su índice (o -1 si no la encuentra).",
    "get": "Obtiene el valor de una clave en un diccionario (devuelve `None` si no existe, sin error).",
    "index": "Busca un elemento y devuelve su índice (error si no lo encuentra).",
    "insert": "Inserta un elemento en una posición específica de una lista.",
    "items": "Devuelve una vista de los pares (clave, valor) de un diccionario.",
    "join": "Une una lista de textos en uno solo, usando un separador.",
    "keys": "Devuelve una vista de las claves de un diccionario.",
    "lower": "Convierte todo el texto a minúsculas.",
    "pop": "Elimina y devuelve el elemento en una posición dada (o el último).",
    "remove": "Elimina la primera aparición de un valor en una lista.",
    "replace": "Reemplaza partes de un texto por otro.",
    "reverse": "Invierte el orden de los elementos de una lista (in-place).",
    "sort": "Ordena los elementos de una lista (in-place).",
    "split": "Divide un texto en una lista de partes, usando un separador.",
    "strip": "Elimina espacios en blanco al inicio y final de un texto.",
    "upper": "Convierte todo el texto a mayúsculas.",
    "values": "Devuelve una vista de los valores de un diccionario.",
    "socket": "Crea un nuevo socket para comunicación de red.",
    "connect": "Conecta el socket a una dirección remota.",
    "recv": "Recibe datos del socket.",
    "send": "Envía datos por el socket.",
    "close": "Cierra la conexión del socket.",
    "forward": "Mueve la tortuga hacia adelante.",
    "left": "Gira la tortuga a la izquierda.",
    "right": "Gira la tortuga a la derecha.",
    "penup": "Levanta el lápiz (no dibuja al moverse).",
    "pendown": "Baja el lápiz (dibuja al moverse).",
    "choice": "Elige un elemento aleatorio de una secuencia.",
    "randint": "Devuelve un número entero aleatorio en un rango.",
    "sleep": "Pausa la ejecución del programa por unos segundos.",
    "coord": "Abreviatura común para 'coordenada'. En gráficos (Turtle), se refiere a la posición (x, y) en la pantalla.",
    "x": "Coordenada horizontal. En Turtle, 0 es el centro, positivo a la derecha, negativo a la izquierda.",
    "y": "Coordenada vertical. En Turtle, 0 es el centro, positivo arriba, negativo abajo.",
    "goto": "Mueve la tortuga a una posición específica (x, y).",
    "setheading": "Establece la orientación (ángulo) de la tortuga.",
    "speed": "Establece la velocidad de la animación de la tortuga."
}